src/Openfoam/AeroSUV_mergedGeom_case_coarse/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 16;

method          scotch;

simpleCoeffs
{
    n               (2 3 1);   // Only used if method is 'simple'
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 3 2);   // For 'hierarchical' method
    delta           0.001;
    order           xyz;
}

distributed      off;
roots            ();


