src/Openfoam/AeroSUV_mergedGeom_case_coarse/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

extractionMethod    extractFromSurface;

extractFromSurfaceCoeffs
{
    // Name of the STL file in constant/triSurface folder
    file    "mergedGeometry.stl";

    // Angle to detect sharp edges, degrees
    extractAngle    150;
}

writeObjFeatures    yes;

